Here I create the pkg file with a new version in it. 

#+BEGIN_SRC sh :var version=0.1
echo "(define-package \"15-112\" \"$version\" \"Introduction to Mathematical Software\" (quote nil))" > 15-112-pkg.el

# remove old files
rm -f ../15-112-$version.tar
rm -fr ../15-112-$version

# make new dir
mkdir ../15-112-$version

# copy everything here to new dir
cp -R * ../15-112-$version

# create tar file for installation
tar -cvf ../15-112-$version.tar ../15-112-$version

# remove old dir
rm -fr ../15-112-$version
#+END_SRC

#+RESULTS:
#+begin_example
../15-112-0.1/
../15-112-0.1/15-112.el
../15-112-0.1/15-112-pkg.el
../15-112-0.1/lists.org
../15-112-0.1/Makefile
../15-112-0.1/python.jpg
../15-112-0.1/#readme.org#
../15-112-0.1/readme.org
../15-112-0.1/sounds/
../15-112-0.1/sounds/fail-buzzer-01.wav
../15-112-0.1/sounds/99636__tomlija__small-crowd-yelling-yeah.wav
../15-112-0.1/syllabus.org
#+end_example

Now, we install it using emacs.
#+BEGIN_SRC emacs-lisp :var version=0.1
(package-install-file 
 (expand-file-name 
  (format "15-112-%s.tar" version)
  ".."))
#+END_SRC

#+RESULTS:
: t



